In [1]:
import pandas as pd

Pandas.apply(): Pass function and apply to every single value of Pandas Serie

In [8]:
df = pd.read_csv('./DataSets/new_data.csv', usecols=['score']).squeeze()

def convertFunc(score):
    if score >= 80:
        return 'PASS'
    else:
        return 'FAIL'
    
applyObj = df.apply(convertFunc)

applyObj

0    PASS
1    PASS
2    FAIL
3    PASS
4    FAIL
Name: score, dtype: object

panda.mean(): return mean of value for required axis

In [14]:
df = pd.DataFrame({"A":[12, 4, 5, None, 1],
                "B":[7, 2, 54, 3, None],
                "C":[20, 16, 11, 3, 8],
                "D":[14, 3, None, 2, 6]})
  
df

      A     B   C     D
0  12.0   7.0  20  14.0
1   4.0   2.0  16   3.0
2   5.0  54.0  11   NaN
3   NaN   3.0   3   2.0
4   1.0   NaN   8   6.0

In [15]:
# skip the Na values while finding the mean
df.mean(axis = 1, skipna = True)

0    13.250000
1     6.250000
2    23.333333
3     2.666667
4     5.000000
dtype: float64

Series.value_counts() function return a Series containing counts of unique values

In [16]:
sr = pd.Series(['New York', 'Chicago', 'Toronto', 'Lisbon', 'Rio', 'Chicago', 'Lisbon'])
sr

0    New York
1     Chicago
2     Toronto
3      Lisbon
4         Rio
5     Chicago
6      Lisbon
dtype: object

In [19]:
sr.value_counts()

Chicago     2
Lisbon      2
New York    1
Toronto     1
Rio         1
Name: count, dtype: int64

Dataframe.assign() function

In [22]:
# single column
values= [['Rohan',455],['Elvish',250],['Deepak',495],
         ['Soni',400],['Radhika',350],['Vansh',450]]
 
df = pd.DataFrame(values,columns=['Name','Total_Marks'])

df = df.assign(Percent = lambda x: (x['Total_Marks'] / 500 * 100))
df

      Name  Total_Marks  Percent
0    Rohan          455     91.0
1   Elvish          250     50.0
2   Deepak          495     99.0
3     Soni          400     80.0
4  Radhika          350     70.0
5    Vansh          450     90.0

In [23]:
# Dataframe.assign() on Multiple Columns

values_list = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80],
               [45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90],
               [51, 2.3, 111]]
 
df = pd.DataFrame(values_list, columns=['Field_1', 'Field_2', 'Field_3'])

df = df.assign(Product = lambda x: (x['Field_1'] * x['Field_2'] * x['Field_3']))
df

   Field_1  Field_2  Field_3  Product
0       15      2.5      100   3750.0
1       20      4.5       50   4500.0
2       25      5.2       80  10400.0
3       45      5.8       48  12528.0
4       40      6.3       70  17640.0
5       41      6.4       90  23616.0
6       51      2.3      111  13020.3